10

In [2]:
4 + 6

10

In [3]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [4]:
import pandas as pd

In [5]:
data = pd.read('names/yob1880.txt')

AttributeError: module 'pandas' has no attribute 'read'

In [6]:
data = pd.read_csv('names/yob1880.txt')

In [7]:
type(data)

pandas.core.frame.DataFrame

In [8]:
data.head()

        Mary  F  7065
0       Anna  F  2604
1       Emma  F  2003
2  Elizabeth  F  1939
3     Minnie  F  1746
4   Margaret  F  1578

In [9]:
data.shape()

TypeError: 'tuple' object is not callable

In [10]:
data.shape

(1999, 3)

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1999 entries, 0 to 1998
Data columns (total 3 columns):
Mary    1999 non-null object
F       1999 non-null object
7065    1999 non-null int64
dtypes: int64(1), object(2)
memory usage: 46.9+ KB

In [12]:
data.describe()

              7065
count  1999.000000
mean     97.258129
std     439.408307
min       5.000000
25%       7.000000
50%      13.000000
75%      41.000000
max    9655.000000

In [13]:
data['Mary']

0            Anna
1            Emma
2       Elizabeth
3          Minnie
4        Margaret
5             Ida
6           Alice
7          Bertha
8           Sarah
9           Annie
10          Clara
11           Ella
12       Florence
13           Cora
14         Martha
15          Laura
16         Nellie
17          Grace
18         Carrie
19          Maude
20          Mabel
21         Bessie
22         Jennie
23       Gertrude
24          Julia
25         Hattie
26          Edith
27         Mattie
28           Rose
29      Catherine
          ...
1969        Philo
1970      Phineas
1971      Presley
1972       Ransom
1973        Reece
1974         Rene
1975      Roswell
1976      Rowland
1977      Sampson
1978       Samual
1979       Santos
1980     Schuyler
1981     Sheppard
1982     Spurgeon
1983     Starling
1984     Sylvanus
1985     Theadore
1986    Theophile
1987       Tilmon
1988        Tommy
1989      Unknown
1990         Vann
1991          Wes
1992      Winston
1993         Wood
1994       Woodie
1995       Worthy
1996       Wright
1997         York
1998    Zachariah
Name: Mary, Length: 1999, dtype: object

In [14]:
data = pd.read_csv('beauty.csv', sep=';')

In [15]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [16]:
data['female'] == 1

0        True
1        True
2        True
3       False
4       False
5        True
6       False
7       False
8        True
9        True
10       True
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18       True
19       True
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
1230    False
1231    False
1232    False
1233    False
1234     True
1235    False
1236    False
1237    False
1238    False
1239    False
1240    False
1241    False
1242    False
1243    False
1244    False
1245    False
1246    False
1247    False
1248    False
1249    False
1250    False
1251    False
1252    False
1253     True
1254     True
1255     True
1256     True
1257     True
1258     True
1259     True
Name: female, Length: 1260, dtype: bool

In [19]:
data[data['female'] == 1]['wage'].mean()

4.299357798165137